{
  "tooltipMap": {
    "Public IP Address": "Public IP can link a user to a network location and, combined with other signals, help track across sessions.",
    "User Agent": "Identifies browser and version; combined with other attributes it narrows down unique profiles.",
    "Platform": "OS/architecture info helps distinguish devices and versions.",
    "Device Memory (GB)": "Approximate RAM can separate device classes and refine fingerprints.",
    "Hardware Concurrency": "Number of CPU cores indicates device capability and can help fingerprint virtual machines.",
    "Screen Dimensions": "Resolution and available screen space are strong fingerprinting attributes.",
    "Color Depth": "Color bit depth adds entropy to fingerprint calculations.",
    "Timezone": "Timezone reveals geographic region and refines user profile.",
    "Language": "Preferred language helps group or distinguish users.",
    "Touch Support": "Whether touch is supported hints at device type (mobile/tablet/desktop).",
    "Cookie Enabled": "Shows whether trackers can persist state via cookies.",
    "Do Not Track": "User preference header; often ignored by trackers but still a signal.",
    "Incognito Mode": "Private browsing changes APIs/limits storage; detectors can flag it as a privacy mode.",
    "Online": "Network connectivity state can influence fingerprinting behavior.",
    "Sites Visited (history.length)": "Browser history length may leak browsing behavior patterns.",
    "Referrer": "Referrer reveals the previous page and can help link visits.",
    "LocalStorage": "Availability of local storage shows persistence options for trackers.",
    "SessionStorage": "Session storage availability indicates per-tab storage capability.",
    "App Name": "Legacy navigator field; may add low-entropy identifying information.",
    "App Version": "Legacy version info could be used alongside UA strings.",
    "Vendor": "Browser vendor string adds to the browser fingerprint.",
    "Product": "Product string is another low-entropy identifier.",
    "ProductSub": "Internal build info that can help distinguish browser builds.",
    "Connection Downlink": "Network speed estimate can hint at connection type and location.",
    "Connection EffectiveType": "Shows cell/wifi type (2g/3g/4g/5g) which helps profiling.",
    "Orientation": "Device orientation (portrait/landscape) may indicate device type and usage.",
    "WebGL Vendor": "GPU vendor helps fingerprint hardware and drivers.",
    "WebGL Renderer": "GPU renderer string is highly distinguishing across systems.",
    "Canvas Fingerprint": "Canvas rendering output varies by GPU, OS, fonts and drivers — commonly used to generate fingerprints.",
    "Audio Fingerprint": "Audio processing output differs between devices and browsers and can add entropy to fingerprints.",
    "Cameras Found": "Presence/number of media devices can hint at hardware and permissions state.",
    "Microphones Found": "Presence/number of audio inputs contributes to device profile.",
    "Plugin": "Installed plugins list (rare now) used historically to identify users.",
    "Filename": "Plugin file names may expose installed software.",
    "Description": "Plugin descriptions provide additional identifying metadata.",
    "MIME Type": "Supported MIME types can reveal installed components.",
    "Extension": "File extensions associated with MIME types further characterize the environment.",
    "Fonts Detected": "Installed fonts are a strong fingerprinting signal because font sets vary widely per system."
  },
  "detailsMap": {
    "Public IP Address": {
      "weight": 20,
      "detail": "<p class=\"detail-what\">The public IP address is the external network address your device uses on the internet (the address seen by websites).</p><p class=\"detail-why\">An IP ties a browser session to a network location and is often unique to a household or corporate network, so it quickly narrows down who or where a visitor is coming from. It carries high weight because it strongly constrains the pool of possible visitors, though it can be noisy due to VPNs, mobile networks, and dynamic assignments.</p><p class=\"detail-how\">Trackers and sites use IP to group visits from the same network and for coarse geolocation; combined with other signals it helps link sessions over time.</p>"
    },
    "User Agent": {
      "weight": 8,
      "detail": "<p class=\"detail-what\">The user agent is a short string the browser sends that usually names the browser, version, and sometimes the operating system.</p><p class=\"detail-why\">On its own it’s not highly unique because many users share the same browser/version, so its weight is moderate; it helps narrow candidate devices when combined with other fields.</p><p class=\"detail-how\">Fingerprinting systems combine the user agent with attributes like fonts, screen size, and WebGL identifiers to form a stronger identifier; it’s commonly included in profiles.</p>"
    },
    "Platform": { "weight": 5, "detail": "<p class=\"detail-what\">Platform indicates the operating system category (for example Windows, macOS, Linux, Android, iOS).</p><p class=\"detail-why\">It separates users into broad groups — useful but not very discriminating on its own.</p><p class=\"detail-how\">Platforms help tune other probes (different fonts or rendering behavior) and are a basic part of a fingerprinting profile.</p>" },
    "Device Memory (GB)": { "weight": 3, "detail": "<p class=\"detail-what\">An approximation of how much RAM the device reports.</p><p class=\"detail-why\">RAM size helps separate phones, tablets, and desktops and can differentiate lower-end from higher-end machines.</p><p class=\"detail-how\">Included as a minor but helpful signal when combined with other metrics; it contributes to uniqueness but is not decisive by itself.</p>" },
    "Hardware Concurrency": { "weight": 3, "detail": "<p class=\"detail-what\">The number of logical CPU cores the browser exposes.</p><p class=\"detail-why\">It gives a rough sense of device capability (older phones versus modern desktops) and can sometimes flag virtualized environments.</p><p class=\"detail-how\">Used as a small entropy source along with CPU type, browser version, and other hardware hints.</p>" },
    "Screen Dimensions": { "weight": 5, "detail": "<p class=\"detail-what\">The display resolution and available screen space reported by the browser.</p><p class=\"detail-why\">Screen size varies widely across devices and is quite useful for distinguishing setups (phone vs laptop, external monitor configurations).</p><p class=\"detail-how\">Often used with color depth and font lists to increase the fingerprint’s uniqueness.</p>" },
    "Color Depth": { "weight": 2, "detail": "<p class=\"detail-what\">The number of bits used to represent color on the display.</p><p class=\"detail-why\">It adds a small amount of information because most modern devices share common values, but occasional differences help narrow candidates.</p><p class=\"detail-how\">Treated as a low-importance extra field that slightly refines matching.</p>" },
    "Timezone": { "weight": 3, "detail": "<p class=\"detail-what\">The local timezone setting of the device (for example America/Los_Angeles).</p><p class=\"detail-why\">Timezone helps narrow down geographic region which is useful context, though many people in a region share the same timezone.</p><p class=\"detail-how\">Combined with language and IP-derived geolocation it helps make fingerprinting more targeted.</p>" },
    "Language": { "weight": 2, "detail": "<p class=\"detail-what\">The preferred language(s) set in the browser.</p><p class=\"detail-why\">Language narrows demographic or regional groups but isn’t unique.</p><p class=\"detail-how\">Useful to complement timezone and locale signals in distinguishing users.</p>" },
    "Touch Support": { "weight": 2, "detail": "<p class=\"detail-what\">Whether the device reports touch events (a basic yes/no).</p><p class=\"detail-why\">It helps separate phones/tablets from desktops and can affect which tests a fingerprinting script runs.</p><p class=\"detail-how\">Used as a capability flag to better classify devices and choose other probes accordingly.</p>" },
    "Cookie Enabled": { "weight": 1, "detail": "<p class=\"detail-what\">Whether cookies are permitted in the browser.</p><p class=\"detail-why\">It’s a simple yes/no that mainly affects how trackers persist state.</p><p class=\"detail-how\">If cookies are disabled, trackers try alternate storage; the flag helps fingerprinting logic adapt but contributes little to uniqueness.</p>" },
    "Do Not Track": { "weight": 0, "detail": "<p class=\"detail-what\">A browser preference header that signals the user's request to opt out of tracking.</p><p class=\"detail-why\">It’s ignored by many sites and provides no identifying uniqueness.</p><p class=\"detail-how\">Rarely used as a fingerprinting signal because it doesn't help identify a device — more about user preference than identity.</p>" },
    "Incognito Mode": { "weight": 3, "detail": "<p class=\"detail-what\">Whether the browser appears to be in a private/incognito session (detected by subtle API differences).</p><p class=\"detail-why\">Private modes change available APIs and storage behavior; detecting them helps sites adapt tracking strategies.</p><p class=\"detail-how\">It’s a useful signal because behavior and available storage differ in private mode; not unique but relevant for conditional logic.</p>" },
    "Online": { "weight": 1, "detail": "<p class=\"detail-what\">Whether the browser reports an online or offline network state.</p><p class=\"detail-why\">It’s a transient status that doesn’t identify a user.</p><p class=\"detail-how\">Mostly used for UI/feature gating, not a strong fingerprinting signal.</p>" },
    "Sites Visited (history.length)": { "weight": 1, "detail": "<p class=\"detail-what\">The length of the browser’s history stack (how many previous pages visited in the tab).</p><p class=\"detail-why\">It can vary rapidly and is not unique.</p><p class=\"detail-how\">Occasionally used as a tiny behavioral signal but not relied on for identification.</p>" },
    "Referrer": { "weight": 1, "detail": "<p class=\"detail-what\">The URL of the previous page that linked to the current site.</p><p class=\"detail-why\">It’s session-specific information but can help connect navigation paths.</p><p class=\"detail-how\">Useful for session linking and analytics, not typically for long-term identity.</p>" },
    "LocalStorage": { "weight": 2, "detail": "<p class=\"detail-what\">Whether the browser supports localStorage (persistent key/value storage).</p><p class=\"detail-why\">Low-to-moderate; availability affects how reliably a tracker can store a persistent identifier.</p><p class=\"detail-how\">Trackers use it as a place to save IDs when cookies are unavailable; presence/absence is a minor fingerprint input.</p>" },
    "SessionStorage": { "weight": 1, "detail": "<p class=\"detail-what\">Whether per-tab sessionStorage is available.</p><p class=\"detail-why\">It’s mainly about storage capability per session/tab.</p><p class=\"detail-how\">It helps decide storage strategies and occasionally contributes a small distinguishing signal.</p>" },
    "App Name": { "weight": 0, "detail": "<p class=\"detail-what\">An older navigator field that historically named the browser application.</p><p class=\"detail-why\">Practically zero for modern fingerprinting — it’s legacy and often the same across many browsers.</p><p class=\"detail-how\">Largely ignored by modern fingerprinting code.</p>" },
    "App Version": { "weight": 0, "detail": "<p class=\"detail-what\">Legacy browser version information.</p><p class=\"detail-why\">Low entropy and typically redundant with the user agent.</p><p class=\"detail-how\">Rarely used today as it adds no meaningful uniqueness.</p>" },
    "Vendor": { "weight": 1, "detail": "<p class=\"detail-what\">A short string sometimes exposing the browser vendor (for example 'Google Inc.').</p><p class=\"detail-why\">It provides vendor-level information but not a unique fingerprint.</p><p class=\"detail-how\">Combined with other fields to help classify the browser.</p>" },
    "Product": { "weight": 0, "detail": "<p class=\"detail-what\">A legacy navigator field with little useful data.</p><p class=\"detail-why\">No real use today for fingerprinting.</p><p class=\"detail-how\">Mostly ignored.</p>" },
    "ProductSub": { "weight": 0, "detail": "<p class=\"detail-what\">A minor internal build string exposed by some browsers.</p><p class=\"detail-why\">Very small and generally constant across many users.</p><p class=\"detail-how\">Rarely used as it gives almost no extra entropy.</p>" },
    "Connection Downlink": { "weight": 2, "detail": "<p class=\"detail-what\">An estimate of the network downlink speed reported by the browser.</p><p class=\"detail-why\">It groups users by connection quality (mobile vs broadband) but is not uniquely identifying.</p><p class=\"detail-how\">Helps tailor content delivery and can be one small factor in profiling.</p>" },
    "Connection EffectiveType": { "weight": 2, "detail": "<p class=\"detail-what\">A coarse label (like 2g/3g/4g/5g/slow-2g) describing network performance.</p><p class=\"detail-why\">Small but useful to categorize connection types and user environment.</p><p class=\"detail-how\">Adds modest context for profiling or feature choices.</p>" },
    "Orientation": { "weight": 1, "detail": "<p class=\"detail-what\">The current screen orientation (portrait or landscape).</p><p class=\"detail-why\">It tells how a device is being used at that moment.</p><p class=\"detail-how\">More useful for UX decisions than identity; occasionally included as a tiny signal.</p>" },
    "WebGL Vendor": { "weight": 10, "detail": "<p class=\"detail-what\">The GPU vendor string reported through WebGL (for example 'Intel', 'NVIDIA', 'AMD').</p><p class=\"detail-why\">It’s a fairly strong hardware hint because GPU vendors/drivers vary across systems.</p><p class=\"detail-how\">Used alongside WebGL renderer and canvas output to fingerprint hardware and drivers; quite useful for distinguishing between devices.</p>" },
    "WebGL Renderer": { "weight": 12, "detail": "<p class=\"detail-what\">The GPU renderer string exposed by WebGL (often a driver or renderer identifier).</p><p class=\"detail-why\">It can be very specific to a particular GPU/driver combo and therefore helps a lot in differentiating devices.</p><p class=\"detail-how\">A commonly used high-entropy field for hardware-level fingerprinting when available.</p>" },
    "Canvas Fingerprint": {
      "weight": 22,
      "detail": "<p class=\"detail-what\">A summary of how the browser renders specific graphics to a canvas element; small rendering differences create a reproducible fingerprint.</p><p class=\"detail-why\">Canvas output varies with GPU, operating system, fonts and drivers, producing a lot of variability between machines; this is why its weight is high.</p><p class=\"detail-how\">Because it yields substantial entropy, many trackers include canvas rendering tests as a high-value signal when allowed.</p>"
    },
    "Audio Fingerprint": { "weight": 8, "detail": "<p class=\"detail-what\">A fingerprint derived from how the browser and device process audio signals (using an offline audio context).</p><p class=\"detail-why\">Results depend on audio stack, drivers, and hardware, and are harder to spoof reliably.</p><p class=\"detail-how\">Employed as a complementary high-quality signal alongside canvas/WebGL to strengthen fingerprints.</p>" },
    "Cameras Found": { "weight": 1, "detail": "<p class=\"detail-what\">The count of available video input devices (cameras).</p><p class=\"detail-why\">Many devices share common values (0,1,2), but it can hint at device class or attached hardware.</p><p class=\"detail-how\">Minor hardware signal; sometimes combined with microphones and other hardware counts.</p>" },
    "Microphones Found": { "weight": 1, "detail": "<p class=\"detail-what\">The count of available audio input devices.</p><p class=\"detail-why\">Similar reasoning to cameras.</p><p class=\"detail-how\">Small supporting hardware signal for profiles.</p>" },
    "Plugins": { "weight": 1, "detail": "<p class=\"detail-what\">The list of installed browser plugins (historically important).</p><p class=\"detail-why\">Modern browsers restrict plugin visibility, but where available plugin lists can be distinguishing.</p><p class=\"detail-how\">Historically useful; now a small or absent signal in most modern browsers.</p>" },
    "Filename": { "weight": 0, "detail": "<p class=\"detail-what\">Plugin filenames when exposed.</p><p class=\"detail-why\">Often unavailable and not reliable.</p><p class=\"detail-how\">Seldom used.</p>" },
    "Description": { "weight": 0, "detail": "<p class=\"detail-what\">Plugin description strings.</p><p class=\"detail-why\">Usually redundant or absent.</p><p class=\"detail-how\">Rarely used for fingerprinting.</p>" },
    "MIME Type": { "weight": 1, "detail": "<p class=\"detail-what\">The MIME types the browser reports it supports.</p><p class=\"detail-why\">It reveals installed components or capabilities but is not usually unique by itself.</p><p class=\"detail-how\">Adds a minor distinguishing signal when combined with others.</p>" },
    "Extension": { "weight": 0, "detail": "<p class=\"detail-what\">File extensions associated with MIME types.</p><p class=\"detail-why\">Not particularly useful for identity.</p><p class=\"detail-how\">Rarely used as a fingerprinting feature.</p>" },
    "Fonts Detected": {
      "weight": 22,
      "detail": "<p class=\"detail-what\">The set of fonts that the browser (and system) makes available; detectable by measuring text rendering.</p><p class=\"detail-why\">Font lists vary a lot between machines and installations, giving a strong and persistent fingerprinting signal.</p><p class=\"detail-how\">One of the most powerful non-hardware signals; when allowed it contributes a lot of entropy to identify or distinguish users across visits.</p>"
    }
  }
}
